// pages/mine/member/equity/equity.js

Page({

    /**
     * 页面的初始数据
     */
    data: {
       msgList: [
           "3张摄影产品拍摄券",
           "拍摄券可预约免费拍摄个人艺术照，宝宝照，亲子照，全家福、孕妇照、形象照，有效期3年",
           "每年可使用1张拍摄券，预约1个摄影产品",
           "每次提供2套服装，2次妆面造型",
           "每套服装赠送15张底片",
           "赠送照片云端终身存储账户，永不丢失"
        ],
        msgList1: [
            "摄影产品拍摄券仅限在鲜檬旗下指定门店预约会员尊享摄影产品使用",
            "摄影产品拍摄券仅限购卡会员本人使用，每次拍摄最多4人",
            "使用摄影产品拍摄券需提前预约，并最终以鲜檬门店可拍摄时间为准",
            "单张摄影产品拍摄券有效期为1年，过期无效（为自然年，即以每年12月31日为期限）",
            "赠送底片为拍摄原片无精修，购买硬产品含精修",
            "会员在拍摄过程中超出会员权益范围内的服务会产生额外收费，收费标准以门店公示为准"
         ],
         msgList2: [
            "加服装：1套100元（含改妆），店内现结",
            "加妆面：1次100元，店内现结",
            "超人数：1人200元（含服装及底妆），店内现结",
            "外景拍摄需求，以各门店拍摄定价为准"
         ]
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad: function(options) {
        
    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow: function() {
       
    },
})